// LSCDestination
"invalidDestination" = "You have entered an invalid server";
"invalidHostname" = "You have entered an invalid hostname";
"invalidDomain" = "You have entered an invalid domain";
"invalidIPAddress" = "You have entered an invalid IP address";
"invalidDestinationDetail" = "Please enter one or more comma-separated hostnames, domain names, IP addresses or address ranges.";
"invalidDestinationDetailEmpty" = "This field must not be empty.";
"invalidDestinationDetailUnableToResolve" = "The specified hostname could not be resolved.";

// LSCRule - port range
"invalidPort" = "You have entered an invalid port";
"invalidPortDetail" = "Please enter a port number from 0 to 65535, a port range in the form “start-end” or a port name like “http” or “imap”.";
"invalidPortRange" = "You have entered an invalid port range.";
"invalidPortRangeDetail" = "Please enter a single port number or a range in the form “start-end”.";
"invalidPortDetailEndPortGreater" = "The maximum value must be greater than the minimum value.";

// LSCRule - protocol
"invalidProtocol" = "You have entered an invalid protocol";
"invalidProtocolDetail" = "Please enter a protocol number from 0 to 255 or a protocol name like TCP or UDP.";
